Revit 2027 API
NavisworksExportOptions.Parameters Property
 Options which specifies the parameter conversion of Navisworks Exporter. Default value is All.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NavisworksParameters Parameters { get; set; }
Public Property Parameters As NavisworksParameters
	Get
	Set
public:
property NavisworksParameters Parameters {
	NavisworksParameters get ();
	void set (NavisworksParameters value);
}
member Parameters : NavisworksParameters with get, set
Property Value
NavisworksParameters
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace